
&НаКлиенте
Процедура ОбъектБДСинонимНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ОбъектБДСиноним",Объект.ОбъектБДСиноним);
	
	//ОткрытьФорму("Справочник.бпсПредметыСогласований.Форма.ФормаВыбораОбъектаСогласования",ДополнительныеПараметры,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ОткрытьФорму("ОбщаяФорма.бпсФормаВыбораОбъектаБД",ДополнительныеПараметры,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
