
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОбъектБД",ПолучитьОбъектБД(ПараметрКоманды));
	ОткрытьФорму("Обработка.бпсСтатусыСогласований.Форма.Форма",ПараметрыФормы);
КонецПроцедуры

&НаСервере
Функция ПолучитьОбъектБД(ПараметрКоманды) 
	пОбъектБД = Неопределено;	
	Если ТипЗнч(ПараметрКоманды) = Тип("БизнесПроцессСсылка.бпсСогласование") Тогда
		пОбъектБД = ПараметрКоманды.ОбъектБД;
	Иначе
		пОбъектБД = ПараметрКоманды;
	Конецесли;
	Возврат пОбъектБД;
КонецФункции 
