Функция ПолучитьПользователяАдресации(РольАдресации,ПодразделениеАдресации) Экспорт
	
	ПользовательАдресации = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бпсРегистрАдресации.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.бпсРегистрАдресации КАК бпсРегистрАдресации
		|ГДЕ
		|	бпсРегистрАдресации.РольАдресации = &РольАдресации
		|	И бпсРегистрАдресации.ПодразделениеАдресации = &ПодразделениеАдресации";
	
	Запрос.УстановитьПараметр("ПодразделениеАдресации", ПодразделениеАдресации);
	Запрос.УстановитьПараметр("РольАдресации", РольАдресации);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ПользовательАдресации = ВыборкаДетальныеЗаписи.Пользователь;
	КонецЕсли;
	
	Возврат ПользовательАдресации;

КонецФункции
