
&НаКлиенте
Процедура КомандаВыбрать(Команда)
	ВыборОбъектаБД();
КонецПроцедуры

&НаКлиенте
Процедура ВыборОбъектаБД()
	СтрокаДЗОбъектыБД = Элементы.ДЗОбъектыБД.ТекущиеДанные;	
	Если СтрокаДЗОбъектыБД <> Неопределено тогда		
		ВладелецФормы_Объект = ЭтаФорма.ВладелецФормы.Объект;
		ВладелецФормы_Объект.ОбъектБДСиноним = СтрокаДЗОбъектыБД.ОбъектБДСиноним;		
		ВладелецФормы_Объект.ОбъектБДИмяМетаданных = СтрокаДЗОбъектыБД.ОбъектБДИмяМетаданных;
		ВладелецФормы_Объект.МенеджерОбъекта = СтрокаДЗОбъектыБД.МенеджерОбъекта;
		ВладелецФормы_Объект.МенеджерОбъектаДляЗапроса = ПолучитьМенеджерОбъектаДляЗапроса(СтрокаДЗОбъектыБД.МенеджерОбъекта);
		ВладелецФормы_Объект.Наименование = "Объект ["+ВладелецФормы_Объект.ОбъектБДСиноним+"]";
		Закрыть();
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Укажить объект согласования и нажмите выбрать";
		Сообщение.Сообщить();
	Конецесли;		
КонецПроцедуры //ВыборОбъектаСогласования()

&НаСервере
Функция ПолучитьМенеджерОбъектаДляЗапроса(пМенеджерОбъекта) Экспорт 
	МенеджерОбъектаДляЗапроса = Неопределено;
	Если пМенеджерОбъекта = "Справочники" Тогда
		МенеджерОбъектаДляЗапроса = "Справочник";
	ИначеЕсли пМенеджерОбъекта = "Документы" Тогда
		МенеджерОбъектаДляЗапроса = "Документ";
	Иначе
		ВызватьИсключение "Не удалось получить менеджер объекта для запроса для МенеджерОбъекта "+пМенеджерОбъекта;
	Конецесли;
	Возврат МенеджерОбъектаДляЗапроса;
КонецФункции //ПолучитьМенеджерОбъектаДляЗапроса(СтрокаДЗОбъектыБД.МенеджерОбъекта)

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	пДЗОбъектыБД = РеквизитФормыВЗначение("ДЗОбъектыБД"); 
	пДЗОбъектыБД.Строки.Очистить();
	
	МассивМенеджеровМетаданных = Новый Массив();
	МассивМенеджеровМетаданных.Добавить("Справочники");
	МассивМенеджеровМетаданных.Добавить("Документы");
	
	Для каждого СтрокаМенеджервМетаданных из МассивМенеджеровМетаданных цикл
		ИмяМенеджера = СтрокаМенеджервМетаданных; 
		
		СтрокаРодитель = пДЗОбъектыБД.Строки.Добавить();	
		СтрокаРодитель.ОбъектБДСиноним = ИмяМенеджера;
		
		
		Для каждого СтрокаМетаданные Из Метаданные[ИмяМенеджера] Цикл
			СтрокаРебенок = СтрокаРодитель.Строки.Добавить();
			СтрокаРебенок.ОбъектБДСиноним = СтрокаМетаданные.Синоним;
			СтрокаРебенок.ОбъектБДИмяМетаданных = СтрокаМетаданные.Имя;
			СтрокаРебенок.МенеджерОбъекта = ИмяМенеджера;
		КонецЦикла;
			
	Конеццикла;
	ЗначениеВРеквизитФормы(пДЗОбъектыБД,"ДЗОбъектыБД");
КонецПроцедуры

&НаКлиенте
Процедура ДЗОбъектыБДПередНачаломИзменения(Элемент, Отказ)
	ВыборОбъектаБД();
КонецПроцедуры
