Функция ПолучитьНастройкиПользователя(Пользователь) Экспорт 
	пНастройкиПользователя = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бпсНастройкиПользователей.Пользователь,
	|	бпсНастройкиПользователей.НеУведомлятьОЗадачахПочтой,
	|	бпсНастройкиПользователей.АдресЭлектроннойПочты,
	|	бпсНастройкиПользователей.ИДПользователяТелеграмм
	|ИЗ
	|	РегистрСведений.бпсНастройкиПользователей КАК бпсНастройкиПользователей
	|ГДЕ
	|	бпсНастройкиПользователей.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		пНастройкиПользователя = Новый Структура();
		пНастройкиПользователя.Вставить("Пользователь",Пользователь);
		
		Выборка = РезультатЗапроса.Выбрать();		
		Пока Выборка.Следующий() Цикл
			пНастройкиПользователя.Вставить("НеУведомлятьОЗадачахПочтой",Выборка.НеУведомлятьОЗадачахПочтой);
			пНастройкиПользователя.Вставить("АдресЭлектроннойПочты",Выборка.АдресЭлектроннойПочты);					
			пНастройкиПользователя.Вставить("ИДПользователяТелеграмм",Выборка.ИДПользователяТелеграмм);					
		КонецЦикла;
	КонецЕсли;
	Возврат пНастройкиПользователя;
КонецФункции //ПолучитьНастройкиПользователя(Пользователь)