Функция ДобавитьСообщение(ДопПараметры) Экспорт
	Если ДопПараметры.Свойство("АдресЭлектроннойПочтыКому") Тогда
		АдресЭлектроннойПочтыКому = ДопПараметры.АдресЭлектроннойПочтыКому;
	Иначе
		ПользовательДляОтправки = ДопПараметры.ПользовательДляОтправки;
		
		Если НЕ ЗначениеЗаполнено(ПользовательДляОтправки) Тогда
			ТекстОшибки = "Ошибка! Не указан пользователь для отправки уведомления";
			РегистрыСведений.бпсОшибки.ДобавитьОшибку(ТекстОшибки,ПредопределенноеЗначение("Перечисление.бпсТипыОшибок.НеУдалосьОтправитьУведомление"));
			Возврат Неопределено;		
		Конецесли;
		
		НастройкиПользователя = РегистрыСведений.бпсНастройкиПользователей.ПолучитьНастройкиПользователя(ПользовательДляОтправки);
		Если НЕ ЗначениеЗаполнено(НастройкиПользователя) Тогда
			//ВызватьИсключение "Ошибка! не заполнены настройки пользователя ["+ПользовательДляОтправки+"] в регистре сведений бпсНастройкиПользователей";
								
			ТекстОшибки = "ВНИМАНИЕ! не удалось отправить уведомление для пользователя ["+ПользовательДляОтправки+"]. Проверьте настройки пользователя в регистре сведений бпсНастройкиПользователей";
			РегистрыСведений.бпсОшибки.ДобавитьОшибку(ТекстОшибки,ПредопределенноеЗначение("Перечисление.бпсТипыОшибок.НеЗаполненыНастройкиПользователя"));
			Возврат Неопределено;
		КонецЕсли;
		Если НастройкиПользователя.НеУведомлятьОЗадачахПочтой Тогда
			Возврат Неопределено;
		Конецесли;
		АдресЭлектроннойПочтыКому = СокрЛП(НастройкиПользователя.АдресЭлектроннойПочты);
		Если НЕ ЗначениеЗаполнено(АдресЭлектроннойПочтыКому) Тогда
			ТекстОшибки = "ВНИМАНИЕ! не заполнен адрес электронной почты ["+ПользовательДляОтправки+"]. Проверьте настройки пользователя в регистре сведений бпсНастройкиПользователей";
			РегистрыСведений.бпсОшибки.ДобавитьОшибку(ТекстОшибки,ПредопределенноеЗначение("Перечисление.бпсТипыОшибок.НеЗаполненыНастройкиПользователя"));					
			Возврат Неопределено;
		Конецесли;
	КонецЕсли;
	
	ИдентификаторСообщения = Строка(Новый УникальныйИдентификатор());
	
	НаборЗаписей = РегистрыСведений.бпсСообщения.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИдентификаторСообщения.Установить(ИдентификаторСообщения);
	Запись = НаборЗаписей.Добавить();
	Запись.ИдентификаторСообщения = ИдентификаторСообщения;
	Запись.Кому = АдресЭлектроннойПочтыКому;
	Запись.Тема = ДопПараметры.Тема;
	
	
	ТекстУведомления = ДопПараметры.Тело;
	
	ПодвалДляПисьма = ПолучитьПодвалДляПисьма();	
	ТекстУведомления = ТекстУведомления + ПодвалДляПисьма;	
	
	Запись.Тело = ТекстУведомления;
	Запись.ДатаСоздания = ТекущаяДата();
	НаборЗаписей.Записать();
	
	Возврат ИдентификаторСообщения;
КонецФункции


Функция ПолучитьПодвалДляПисьма() Экспорт 
	ПодвалДляПисьма = " 
		|
		|
		|
		|
		|_____________________________________________________________________
		|
		|Письмо сформировано автоматически. Пожалуйста, не отвечайте на него.
		//|Информация о базе: ["+СтрокаСоединенияИнформационнойБазы()+"]
		|" 
		;	
	Возврат ПодвалДляПисьма;
КонецФункции //ПолучитьПодвалДляПисьма()

Процедура ОтправитьСообщения() Экспорт
	Если НЕ бпсОбщийМодуль.ЭтоРабочаяБаза() Тогда
		Возврат;
	Конецесли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бпсСообщения.ИдентификаторСообщения,
	|	бпсСообщения.Кому,
	|	бпсСообщения.Тема,
	|	бпсСообщения.Тело,
	|	бпсСообщения.ДатаСоздания,
	|	бпсСообщения.ДатаОтправки,
	|	бпсСообщения.КоличествоПопыток
	|ИЗ
	|	РегистрСведений.бпсСообщения КАК бпсСообщения
	|ГДЕ
	|	бпсСообщения.ДатаОтправки = ДАТАВРЕМЯ(1, 1, 1)
	|	И бпсСообщения.КоличествоПопыток < 5";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	Конецесли;
	
	СистемнаяУчетнаяЗаписьЭлектроннойПочты = Справочники.бпсУчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
	
	Соединение = бпсОбщийМодуль.УстановитьСоединениеСПочтой(СистемнаяУчетнаяЗаписьЭлектроннойПочты);
	
	Выборка = РезультатЗапроса.Выбрать();
		
	Пока Выборка.Следующий() Цикл
		пИдентификаторСообщения = Выборка.ИдентификаторСообщения;
		ПараметрыПисьма = Новый Структура;
		ПараметрыПисьма.Вставить("Кому", Выборка.Кому);
		ПараметрыПисьма.Вставить("Тело", Выборка.Тело);
		ПараметрыПисьма.Вставить("Тема", Выборка.Тема);
		СообщениеОтправлено = Ложь;
		Попытка
			бпсОбщийМодуль.ОтправитьПочтовоеСообщение(СистемнаяУчетнаяЗаписьЭлектроннойПочты,ПараметрыПисьма,Соединение);	
			СообщениеОтправлено = Истина;
		Исключение
			ТекстОписаниеОшибки = ОписаниеОшибки();
		КонецПопытки;
		
		пПараметрыОтбора = Новый Структура();
		пПараметрыОтбора.Вставить("ИдентификаторСообщения",пИдентификаторСообщения);
		ВыборкабпсСообщения = РегистрыСведений.бпсСообщения.Выбрать(пПараметрыОтбора);
		Пока ВыборкабпсСообщения.Следующий() Цикл
			Запись = ВыборкабпсСообщения.ПолучитьМенеджерЗаписи();
			Запись.Прочитать();
			Если СообщениеОтправлено Тогда
				Запись.ДатаОтправки = ТекущаяДата();
			Иначе
				Запись.КоличествоПопыток = Запись.КоличествоПопыток + 1;
				Запись.ИнформацияООшибке = "" + ТекстОписаниеОшибки;
			Конецесли;
			Запись.Записать();
		Конеццикла;
	КонецЦикла;
КонецПроцедуры //ОтправитьСообщения()