
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Источник = ПараметрКоманды;
	ЭтоСогласование = ТипЗнч(Источник) = Тип("БизнесПроцессСсылка.бпсСогласование");
	
	ФормаИсточник = ПараметрыВыполненияКоманды.Источник;
	
	ДопПараметры = Новый Структура();
	ДопПараметры.Вставить("Источник",Источник);	
	ДопПараметры.Вставить("ЭтоСогласование",ЭтоСогласование);	
	пПользовательскиеНастройки = ПолучитьПользовательскиеНастройкиОтчета(ДопПараметры);
	
	
	ПараметрыФормы=Новый Структура();
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
    ПараметрыФормы.Вставить("ПользовательскиеНастройки",пПользовательскиеНастройки);
	пПредметСогласования = Неопределено;
	Если ФормаИсточник.ИмяФормы = "Обработка.бпсСтатусыСогласований.Форма.Форма" Тогда
		пПредметСогласования = ФормаИсточник.Объект.ПредметСогласования;
		Отбор = Новый Структура();
		Отбор.Вставить("ПредметСогласования",пПредметСогласования);		
		ПараметрыФормы.Вставить("Отбор",Отбор);
	Конецесли;	
	ОткрытьФорму("Отчет.бпсОтчетЛистСогласования.Форма.ФормаОтчета",ПараметрыФормы, , Новый УникальныйИдентификатор);			
КонецПроцедуры

&НаСервере
Функция ПолучитьПользовательскиеНастройкиОтчета(ДопПараметры)
	ПараметрыОтчета = Новый Структура();
	
	Источник = ДопПараметры.Источник;	
	Если ДопПараметры.ЭтоСогласование Тогда
		ПараметрыОтчета.Вставить("ОбъектБД",Источник.ОбъектБД);
	Иначе
		ПараметрыОтчета.Вставить("ОбъектБД",Источник);
	Конецесли;
	ПараметрыОтчета.Вставить("ПоказыватьТолькоПоследниеСогласования",Истина);
	
	ОтчетОбъект=Отчеты.бпсОтчетЛистСогласования.Создать();
	КомпоновщикНастроек = ОтчетОбъект.КомпоновщикНастроек;
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	Для каждого ПараметрОтчета Из ПараметрыОтчета Цикл
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(ПараметрОтчета.Ключ, ПараметрОтчета.Значение);
	КонецЦикла;
	КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	Возврат КомпоновщикНастроек.ПользовательскиеНастройки;
КонецФункции