
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ФормаИсточник = ПараметрыВыполненияКоманды.Источник;
	МассивЗадач = ФормаИсточник.Элементы.Список.ВыделенныеСтроки;
	УстановитьСвойствоЗадачиНаСервере(МассивЗадач);
	Оповестить("ЗадачаФормаСписка_Обновить");
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойствоЗадачиНаСервере(МассивЗадач) Экспорт
	ИмяСвойстваСкрыта = РегистрыСведений.бпсСвойстваЗадач.ПолучитьИмяСвойстваСкрыта();
	Для каждого СтрокаМассивЗадач из МассивЗадач цикл		
		ЗадачаСсылка = СтрокаМассивЗадач;
		пСкрыта = РегистрыСведений.бпсСвойстваЗадач.ПолучитьЗначениеСвойстваЗадачи(ЗадачаСсылка,ИмяСвойстваСкрыта);
		Если ТипЗнч(пСкрыта) = Тип("Булево") Тогда
			пСкрыта = НЕ пСкрыта;
		Иначе
			пСкрыта = Истина;
		Конецесли;
		РегистрыСведений.бпсСвойстваЗадач.УстановитьЗначениеСвойстваЗадачи(ЗадачаСсылка,ИмяСвойстваСкрыта,пСкрыта);
	Конеццикла;
КонецПроцедуры //УстановитьСвойствоЗадачиНаСервере(ЗадачаСсылка)

