
Функция ПолучитьЗначениеКонстанты(ИмяКонстанты,ТипКонстанты,Отказ = Ложь,ВыдаватьСообщенияОбОшибках = Истина, ВызыватьИсключение = Ложь) Экспорт 

	мЗначениеКонстанты = Неопределено;
	
	МассивОшибок = Новый Массив();
	пКонстанта = ПредопределенноеЗначение("Справочник.бпсКонстанты."+ИмяКонстанты);
	мЗначениеКонстанты = пКонстанта.Значение;	
	Если ТипЗнч(ТипКонстанты) = Тип("Строка") Тогда
		ТипКонстанты = Тип(ТипКонстанты);
	Конецесли;
	
	Если мЗначениеКонстанты = Неопределено 
		ИЛИ ТипЗнч(мЗначениеКонстанты) <> ТипКонстанты
		ИЛИ НЕ ЗначениеЗаполнено(мЗначениеКонстанты) Тогда
		Если ВыдаватьСообщенияОбОшибках Тогда
			МассивОшибок.Добавить("Ошибка! Не указано значение элемента """+ИмяКонстанты+""", в константах (БПС)");
		Конецесли;
		Отказ = Истина;
	Конецесли;
	
	Если ВыдаватьСообщенияОбОшибках Тогда
		Для каждого ЭлМассиваСообщений из МассивОшибок цикл
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ЭлМассиваСообщений;
			Сообщение.Сообщить();		
		Конеццикла;
	Конецесли;
	
	Если ВызыватьИсключение
		И МассивОшибок.Количество() > 0 Тогда
		
		ВызватьИсключение "Ошибка! есть ошибки при получении значений констант";
		
	Конецесли;
	
	Возврат мЗначениеКонстанты;
	
КонецФункции 
