
&НаКлиенте
Процедура КомандаСогласовано(Команда)
	КомандаСогласования = ПредопределенноеЗначение("Перечисление.бпсКомандыСогласования.Согласовано");
	ВыполнитьКомандуНаКлиенте(КомандаСогласования);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандуНаКлиенте(КомандаСогласования)
	ВыполнитьЗадачуНаСервере(КомандаСогласования);
	Модифицированность = Ложь;
	Оповестить("ЗадачаФормаСписка_Обновить");	
	Оповестить("бпсСтатусыСогласований_Обновить");
	Закрыть();	
КонецПроцедуры //ВыполнитьКомандуНаКлиенте("Согласовано")

&НаСервере
Процедура КомандаСогласованоНаСервере(КомандаСогласования) Экспорт
	ВыполнитьЗадачуНаСервере(КомандаСогласования);	
КонецПроцедуры //КомандаСогласованоНаСервере()

&НаСервере
Процедура ВыполнитьЗадачуНаСервере(КомандаСогласования) Экспорт
	БизнесПроцессОбъект = РеквизитФормыВЗначение("Объект"); 
	ДопПараметры = Новый Структура();
	ДопПараметры.Вставить("ЗадачаСсылка",ЗадачаСсылка);
	ДопПараметры.Вставить("Рецензия",Рецензия);
	ДопПараметры.Вставить("КомандаСогласования",КомандаСогласования);
	БизнесПроцессОбъект.ВыполнитьЗадачу(ДопПараметры);
КонецПроцедуры //ВыполнитьЗадачуНаСервере(Истина)

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗадачаСсылка = Параметры.ЗадачаСсылка;
	
	КлючЗадачи = ЗадачаСсылка.КлючЗадачи;
	ПараметрыОтбора=Новый Структура();
	ПараметрыОтбора.Вставить("КлючЗадачи",КлючЗадачи);
	НайденныеСтроки = Объект.ЛистСогласования.НайтиСтроки(ПараметрыОтбора);
	Для каждого СтрокаЛистСогласования из НайденныеСтроки цикл
		Пояснение = СтрокаЛистСогласования.Пояснение;
		Рецензия = СтрокаЛистСогласования.Рецензия;
	Конеццикла;
	Заголовок = ЗадачаСсылка.Наименование;
	
	УстановитьОтборДляИсторииРецензий();
	
	Элементы.ФормаКомандаВозвращеноНаДоработку.Видимость = Ложь;
	Если Объект.РазрешеноПовторноеСогласование Тогда
		Элементы.ФормаКомандаВозвращеноНаДоработку.Видимость = Истина;
	Конецесли;
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборДляИсторииРецензий() Экспорт
	ИсторияРецензий.Параметры.УстановитьЗначениеПараметра("ИсходныйБизнесПроцесс",Объект.Ссылка);
КонецПроцедуры //ИзменитьЭлементОтбораСписка()

&НаКлиенте
Процедура КомандаНеСогласовано(Команда)
	КомандаСогласования = ПредопределенноеЗначение("Перечисление.бпсКомандыСогласования.НеСогласовано");
	ВыполнитьКомандуНаКлиенте(КомандаСогласования);
КонецПроцедуры

&НаКлиенте
Процедура КомандаВозвращеноНаДоработку(Команда)
	КомандаСогласования = ПредопределенноеЗначение("Перечисление.бпсКомандыСогласования.ВернутьНаДоработку");
	ВыполнитьКомандуНаКлиенте(КомандаСогласования);
КонецПроцедуры
