Процедура ПередЗаписью(Отказ)
	ПроверитьИспользуетсяЛиАлгоритмВСогласованиях(Отказ);	
	Если Отказ Тогда
		Возврат;
	Конецесли;
	//ТекстЗапроса = "";
	//НастройкиКомпоновщикаХранилище = Неопределено;
	//ТекстПроизвольногоУсловия = "";
	//пНастройкиКомпоновщика = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	//НастройкиКомпоновщикаХранилище = Новый ХранилищеЗначения(пНастройкиКомпоновщика);
	//
	//ТекстЗапроса = Справочники.бпсАлгоритмыНахожденияСогласователей.СформироватьТекстЗапроса(Владелец, пНастройкиКомпоновщика);
	 
КонецПроцедуры

Процедура ПроверитьИспользуетсяЛиАлгоритмВСогласованиях(Отказ) Экспорт
	Если Отказ Тогда
		Возврат;
	Конецесли;
	Если ЭтоНовый() Тогда
		Возврат;
	Конецесли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бпсПредметыСогласованийОпределениеЛистаСогласования.Ссылка КАК ПредметСогласования
	|ПОМЕСТИТЬ ВТПредметыСогласования
	|ИЗ
	|	Справочник.бпсПредметыСогласований.ОпределениеЛистаСогласования КАК бпсПредметыСогласованийОпределениеЛистаСогласования
	|ГДЕ
	|	бпсПредметыСогласованийОпределениеЛистаСогласования.АлгоритмНахожденияСогласователей = &АлгоритмНахожденияСогласователей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	бпсСогласование.Ссылка
	|ИЗ
	|	БизнесПроцесс.бпсСогласование КАК бпсСогласование
	|ГДЕ
	|	бпсСогласование.ПредметСогласования В
	|			(ВЫБРАТЬ
	|				ВТПредметыСогласования.ПредметСогласования
	|			ИЗ
	|				ВТПредметыСогласования)
	|	И бпсСогласование.Стартован";
	
	Запрос.УстановитьПараметр("АлгоритмНахожденияСогласователей", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Отказ = Истина;
		Сообщить("Ошибка! нельзя изменять этот алгоритм нахождения согласователей, т.к. он уже используется в согласованиях.");
	КонецЦикла;	
КонецПроцедуры 


