


Процедура ПередЗаписью(Отказ)
	ПроверитьИспользуетсяЛиУсловиеВСогласованиях(Отказ);	
	Если Отказ Тогда
		Возврат;
	Конецесли;
	ТекстЗапроса = "";
	Если ПроизвольноеУсловие Тогда
		НастройкиКомпоновщикаХранилище = Неопределено;
	Иначе
		ТекстПроизвольногоУсловия = "";
		пНастройкиКомпоновщика = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
		НастройкиКомпоновщикаХранилище = Новый ХранилищеЗначения(пНастройкиКомпоновщика);
		
		ТекстЗапроса = Справочники.бпсУсловия.СформироватьТекстЗапроса(Владелец, пНастройкиКомпоновщика);
	Конецесли;
	
КонецПроцедуры

Процедура ПроверитьИспользуетсяЛиУсловиеВСогласованиях(Отказ) Экспорт
	Если Отказ Тогда
		Возврат;
	Конецесли;
	Если ЭтоНовый() Тогда
		Возврат;
	Конецесли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бпсПредметыСогласованийОпределениеЛистаСогласования.Ссылка КАК ПредметСогласования
	|ПОМЕСТИТЬ ВТПредметыСогласования
	|ИЗ
	|	Справочник.бпсПредметыСогласований.ОпределениеЛистаСогласования КАК бпсПредметыСогласованийОпределениеЛистаСогласования
	|ГДЕ
	|	бпсПредметыСогласованийОпределениеЛистаСогласования.Условие = &Условие
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	бпсСогласование.Ссылка
	|ИЗ
	|	БизнесПроцесс.бпсСогласование КАК бпсСогласование
	|ГДЕ
	|	бпсСогласование.ПредметСогласования В
	|			(ВЫБРАТЬ
	|				ВТПредметыСогласования.ПредметСогласования
	|			ИЗ
	|				ВТПредметыСогласования)
	|	И бпсСогласование.Стартован";
	
	Запрос.УстановитьПараметр("Условие", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Отказ = Истина;
		Сообщить("Ошибка! нельзя изменять условие, т.к. оно уже используется в согласованиях.");
	КонецЦикла;	
КонецПроцедуры 


