Функция ПолучитьПредметСогласованияПоТипуОбъекта(пТипОбъектаБД) Экспорт 
	пПредметСогласования = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	бпсПредметыСогласований.Ссылка,
	|	бпсПредметыСогласований.ТипОбъектаБД
	|ИЗ
	|	Справочник.бпсПредметыСогласований КАК бпсПредметыСогласований
	|ГДЕ
	|	бпсПредметыСогласований.ТипОбъектаБД = &ТипОбъектаБД
	|	И НЕ бпсПредметыСогласований.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	бпсПредметыСогласований.Код";
	
	Запрос.УстановитьПараметр("ТипОбъектаБД", пТипОбъектаБД);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		пПредметСогласования = Выборка.Ссылка;
	Конецесли;
	Возврат пПредметСогласования;
	
КонецФункции //ПолучитьПредметСогласованияПоТипуОбъекта()

Функция ИспользуетсяЛиВСогласованиях(ПредметСогласования) Экспорт
	пИспользуетсяВСогласованиях = Ложь;	
	Если ПредметСогласования.Пустая() Тогда
		Возврат пИспользуетсяВСогласованиях;
	Конецесли;
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	бпсСогласование.Ссылка
	|ИЗ
	|	БизнесПроцесс.бпсСогласование КАК бпсСогласование
	|ГДЕ
	|	бпсСогласование.ПредметСогласования = &ПредметСогласования
	|	И бпсСогласование.Стартован";
	
	Запрос.УстановитьПараметр("ПредметСогласования", ПредметСогласования);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		пИспользуетсяВСогласованиях = Истина;		
	Конецесли;
	Возврат пИспользуетсяВСогласованиях;	
КонецФункции