
&НаСервереБезКонтекста
Процедура КомандаОтправитьТестовоеСообщениеНаСервере(АдресЭлектроннойПочтыКому)
	ПараметрыПисьма = Новый Структура;
	ПараметрыПисьма.Вставить("Кому", АдресЭлектроннойПочтыКому);
	ПараметрыПисьма.Вставить("Тело", "BSP.Тестовое письмо");
	ПараметрыПисьма.Вставить("Тема", "BSP.Тестовое письмо");
	ИдентификаторСообщения = бпсОбщийМодуль.ОтправитьПочтовоеСообщение(Справочники.бпсУчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты,ПараметрыПисьма);	
	Если ЗначениеЗаполнено(ИдентификаторСообщения) Тогда
		Сообщить("Тестовое сообщение отправлено");
	Иначе
		Сообщить("Ошибка! Тестовое сообщение не отправлено");
	Конецесли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтправитьТестовоеСообщение(Команда)
	Перем ВыбЗнач;
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	КС = Новый КвалификаторыСтроки(100);
	ОписаниеТипов = Новый ОписаниеТипов(Массив, , КС, );
	ВыбЗнач = Объект.АдресЭлектроннойПочты;
	Оповещение = Новый ОписаниеОповещения("ПослеВводаЗначения", ЭтаФорма, Параметры);
	ПоказатьВводЗначения(Оповещение,ВыбЗнач, "Укажите адрес электронной почты куда отправить тестовое письмо", ОписаниеТипов);
		
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступность()
	Элементы.ГруппаСтраницаНастройкиРасширенные.Видимость = Ложь;
	Элементы.ГруппаДополнительныеНастройки.Видимость = Ложь;
	Если РасширенныеНастройки Тогда
		Элементы.ГруппаСтраницаНастройкиРасширенные.Видимость = Истина;
	Конецесли;
	Если Объект.ИспользоватьТиповыеСредства1сПриОтправкеПочты Тогда
		Элементы.ГруппаДополнительныеНастройки.Видимость = Истина;
	Конецесли;
КонецПроцедуры 

&НаКлиенте
Процедура ПослеВводаЗначения(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	Конецесли;
	АдресЭлектроннойПочтыКому = РезультатЗакрытия;
	КомандаОтправитьТестовоеСообщениеНаСервере(АдресЭлектроннойПочтыКому);	
КонецПроцедуры //ПослеВводаЗначения

&НаКлиенте
Процедура РасширенныеНастройкиПриИзменении(Элемент)
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.ИспользоватьДляОтправки = Истина;
	Объект.ИспользоватьДляПолучения = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	Объект.ИмяПользователя = Объект.Пользователь;
	Объект.ПользовательSMTP = Объект.Пользователь;
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьТиповыеСредства1сПриОтправкеПочтыПриИзменении(Элемент)
	УстановитьВидимостьДоступность();
КонецПроцедуры
