
&НаСервереБезКонтекста
Процедура ЗаполнитьНастройкамиПоУмолчаниюНаСервере()
	
	Макет = РегистрыСведений.бпсПроксиСерверы.ПолучитьМакет("НастройкиПоУмолчанию");

	ТЗНастройкиПоУмолчанию= Новый ТаблицаЗначений();
	ТЗНастройкиПоУмолчанию.Колонки.Добавить("Адрес", Новый ОписаниеТипов("Строка"));
	ТЗНастройкиПоУмолчанию.Колонки.Добавить("Порт", Новый ОписаниеТипов("Число"));
	ТЗНастройкиПоУмолчанию.Колонки.Добавить("Логин", Новый ОписаниеТипов("Строка"));
	ТЗНастройкиПоУмолчанию.Колонки.Добавить("Пароль", Новый ОписаниеТипов("Строка"));

	Для НомерСтроки = 2 По Макет.ВысотаТаблицы Цикл
		СтрокаТЗНастройкиПоУмолчанию = ТЗНастройкиПоУмолчанию.Добавить();		
		СтрокаТЗНастройкиПоУмолчанию.Адрес = СокрЛП(Макет.Область(НомерСтроки,1).Текст);
		СтрокаТЗНастройкиПоУмолчанию.Порт = Число(СокрЛП(Макет.Область(НомерСтроки,2).Текст));
		СтрокаТЗНастройкиПоУмолчанию.Логин = СокрЛП(Макет.Область(НомерСтроки,3).Текст);
		СтрокаТЗНастройкиПоУмолчанию.Пароль = СокрЛП(Макет.Область(НомерСтроки,4).Текст);
	КонецЦикла;
	
	НаборЗаписей = РегистрыСведений.бпсПроксиСерверы.СоздатьНаборЗаписей();
	НаборЗаписей.Загрузить(ТЗНастройкиПоУмолчанию);
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНастройкамиПоУмолчанию(Команда)
	ЗаполнитьНастройкамиПоУмолчаниюНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры
